

//5.Опишите, что нужно сделать, чтобы во время выполнения программы вывести значение любого свойства или функции.
//Ответ: // установить брейкпоинт на это значение или функцию (Edit breakpoint -> Debugger Command -> po name)

// 6. Опишите, что нужно сделать, чтобы во время выполнения программы поменять значение у любого свойства.
//Ответ: Edit breakpoint -> Debugger Command -> expression self.Name = "new"

// 7. Укажите, как с помощью брейкпоинтов отслеживать изменения значений у выбранного свойства.
//Ответ: установить брейкпоинт на нужное значение и в консоли указать (Watch "name")

// 8. Укажите, как отслеживать вызов системных функций.
//Ответ: через Profile -> Time Profile

// 9. Выберите любые семь инструментов Xcode и опишите, для чего они используются.
// Ответ:
// 1) Network: анализ трафика в сеть
// 2) SwiftUI: мониторинг потребления ресурсов вью-элементами
// 3) Zombies: отладка ошибок памяти из-за неправильной логики в коде
// 4) Core Data: отладка использования core data
// 5) Allocation: следит за виртуальной памятью
// 6) Blank: туда можно указать за чем необходимо следить
// 7) Activity Monitor: следит за использованием ресурсов
